@extends('layouts.provider')

@section('content')

<div class="uk-section uk-section-default">
    <div class="uk-container uk-container-small">

        <h1 class="uk-text-center">
            事業者利用規約
        </h1>

        <p>
        この事業者利用規約（以下「本規約」といいます。）は、株式会社TODOROKI（以下「当社」といいます。）と、当社が提供するサービス（以下、「本サービス」）を利用する事業者（以下「事業者」といいます。）との間の契約関係（以下「本契約」といいます。）を定めるものです。
        </p>

        <h2>
        第1条（適用）
        </h2>
        <p>
        本規約は、事業者と当社との間の本サービスの利用に関わる一切の関係に適用されるものとします。
        </p>

        <h2>
        第2条（用語の定義について）
        </h2>
        <p>
        本規約において使用する用語の意義は、次の各号に定めるとおりとします。<br/>
        （1）「体験」とは、事業者が提供する体験型プログラムその他の予約申込が必要な役務をいいます。<br/>
        （2）「ユーザー」とは、当社が運営するWebサイトを利用している方をいいます。<br/>
        （3）「事業者」とは、当社と契約のうえ、「tamate baco」に体験、又はイベントの情報を掲載する法人又は個人をいいます。<br/>
        （4）「チケット」とは、一定の条件に従い当社から発行される電磁的記録を提示することで、事業者から事業者の管理する施設への入場許可その他の商品又は役務（以下「事業者サービス」といいます。）の提供を受けることができる権利をいいます。<br/>
        （5）「登録情報」とは、メールアドレス、ID、パスワード、氏名、生年月日、性別などユーザーが当社に提供する情報をいいます。<br/>
        （6）「tamate baco」とは、当社の運営するWebサイトのことをいいます。
        </p>

        <h2>
        第3条（利用契約の成立）
        </h2>
        <p>
        （1）本サービスの利用を希望する事業者は、当社が別途指定する管理画面（以下「管理画面」といいます。）への登録を行うことで、当社と事業者との間で本規約を内容とする本契約が成立します。<br/>
        （2）事業者は、管理画面に登録した事項に変更があった場合には、速やかに変更の内容を反映するものとします。かかる届出の懈怠に起因する損害については、当社は一切責任を負いません。
        </p>

        <h2>
        第4条（サービス利用条件）
        </h2>
        <p>
        事業者は、本サービス利用開始時に、以下の各号に定める事項をすべて満たすものとします。事業者は、次の各号に定める条件のいずれかを満たさなくなった場合、本サービスが利用できなくなることについて同意し、あらかじめ承諾するものとします。<br/>
        （1）事業者利用規約に同意していること<br/>
        （2）事業者利用規約その他当社との間の契約の違反がないこと
        </p>

        <h2>
        第5条（事業者プランの掲載等）
        </h2>
        <p>
        （1）当社は、tamate bacoに、事業者の提供しているサービスの内容、提供期間または提供日時、提供場所、利用条件その他の取引条件（以下「事業者プラン」といいます。）、および事業者プランの紹介文、画像その他の情報を掲載したWebページ（以下「体験詳細ページ」といいます。）を制作するために必要な情報を、当社が指定するデータ形式およびデータ交付手段により当社に提供するものとします。なお、事業者が事業者利用規約に基づき本サイト制作に必要な情報を当社に提供している場合、当社と事業者で別途合意する場合を除き、当該情報の提供をもって、本項の事業者情報の提供とみなします。<br/>
        （2）事業者は、事業者の提供情報について以下の各号の事項を保証するものとします。<br/>
        　（a）法令等（特定商取引法、不当景品類および不当表示防止法、個人情報の保護に関する法律、ならびに所管の官公庁の定めるガイドライン等を含みます）に違反していないこと　（b）事業者が当社への提供および利用許諾に関して正当な権限を有し（権利を有する第三者から事業者が使用許諾を受けている場合を含みます）、第三者の著作権、商標権、肖像権、パブリシティ権その他一切の権利を侵害しないこと<br/>
        　（c）虚偽の内容またはユーザーを誤認させる内容を含まないこと<br/>
        （3）事業者は、事業者ページの公開後、事業者ページの内容について訂正または変更等を行う必要が生じた場合（事業者の体験の内容、事業者の連絡先、体験の提供場所・提供時間等の変更等を含みますがこれらに限りません。）、直ちに当社に通知するものとします。当社は、当社が必要と判断した場合、すみやかに事業者ページの訂正または変更を行うものとします。<br/>
        （4）事業者は、当社が、事業者に通知することなく、事業者ページに当社または第三者の広告・宣伝のための文章、画像、動画等の情報を掲載または配信することができることをあらかじめ承諾し、これに対して異議を述べないものとします。この場合、当該情報の掲載または配信から得られる収入は当社に帰属するものとします。
        </p>

        <h2>
        第6条（事業者サービスの提供）
        </h2>
        <p>
        （1）ユーザーに対する事業者の体験の提供は、事業者プラン記載の条件に従い、事業者が自己の責任と負担によって行うものとします。<br/>
        （2）事業者は、ユーザーとの取引にあたっては、良質なサービス提供等を行うことを旨とし、顧客満足の向上に努めるとともに、法令を遵守し、社会的規範を尊重のうえ、当社および事業者ならびに本サービスの信用の保持に努めるものとします。<br/>
        （3）事業者は、事業者とユーザー、提携販売店その他の第三者との間で、事業者サービスに関連または付随する紛争が生じた場合には、すべて事業者の責任と負担において解決するものとし、当社および提携販売店に何ら迷惑をかけないものとます。ただし、当社の責に帰すべき事由による紛争についてはこの限りではありません。<br/>
        （4）前項の紛争に関連して当社または提携販売店がユーザーその他の第三者に損害賠償等の対応を行うことを余儀なくされた場合には、当社は事業者に対しその対応方針等について通知した上で対応するものとし、事業者は、故意または過失の有無にかかわらず、当社または提携販売店が支払った金銭の全額および解決のために要した弁護士費用その他一切の費用を当社または提携販売店に対して支払うものとします。<br/>
        （5）事業者は、事業者プランにおいて事業者サービスの利用条件を設定する場合、ユーザーが当該利用条件を充足していることの確認を事業者の責任と負担において実施するものとします。なお、事業者は、ユーザーに事業者プランに定める以外の利用条件以外の制限を設けるなど、ユーザーに不利となる差別的取扱いをしてはならないものとします。<br/>
        （6）事業者は、ユーザーによる事業者サービスの利用において、ユーザーが遵守すべき事項、事故等（怪我、病状の悪化、苦痛、不安、死亡等を含みますがこれらに限りません。）のリスク、その他注意事項等（以下「重要事項」といいます。）がある場合、重要事項の内容についてユーザーに事前に十分に説明するものとします。また、事業者は、ユーザーが重要事項を理解した上で事業者サービスを利用することについて、事業者の責任と負担において同意を得るものとします。<br/>
        （7）事業者は、ユーザーによって提示されたチケットが以下の各号のいずれかに該当する場合、事業者は事業者サービスの提供を行ってはならないものとします。<br/>
        　（a）チケットの有効期間を経過している場合<br/>
        　（b）チケットに利用済処理が施されている場合<br/>
        （8）事業者は、本契約期間中か本契約終了後（終了の理由を問いません。以下本契約において同じ。）かを問わず、本契約終了日までにチケットを利用した予約を完了したユーザーに対し、事業者サービスの利用条件に従い、事業者サービスを提供できる体制を維持するものとします。万一、事業者がかかる体制の維持ができなくなる事情が発生した場合（発生原因を問いません）、直ちに当社に対してその旨通知し、当社の求めに応じて、必要な措置を講じなければならないものとします。<br/>
        （9）事業者が自己都合で事業者プランを変更する場合、すでにチケットを発行したユーザーに対しては同じサービスを提供する。もしくは直ちに当社に連絡の上、同等のプランを用意しなければならないものとします。これらの対応が不可能な場合は、直ちに当社へ連絡するものとします。
        </p>

        <h2>
        第7条（事業者への対価）
        </h2>
        <p>
        （1）当社は本サービスを利用したユーザーに対し、本規約に従い事業者が事業者サービスを提供した場合、事業者に対し報酬（以下、「事業者分配金」といいます。）を支払うものとします。<br/>
        （2）事業者分配金の算出方法は、別途定めるものとします。<br/>
        （3）事業者は、tamate baco を利用したユーザーに対し、本規約に従い事業者が事業者サービスを提供した場合、事業者が属する月の翌月3日までに当社に、当社が定める方法で報告するものとします。<br/>
        （4）当社は、事業者に対し、事業者分配金を前項の報告に基づき、月末締め、翌々月10日（10日が金融機関営業日ではない場合は前営業日）限りで支払うものとします。<br/>
        （5）当社は、事業者分配金を、事業者が指定する金融機関口座に振込支払いするものとします。
        </p>

        <h2>
        第8条（情報の取扱い）
        </h2>
        <p>
        （1）事業者は、本サービスの利用関連または付随して取得したユーザーに関する情報（以下「ユーザー情報」といいます。）を、本契約の目的の範囲内においてのみ使用するものとします。また、事業者は、当社の事前の書面による承諾なく、ユーザー情報が記載・記録された媒体を、必要な限度を超えて複写、複製してはならないものとします。<br/>
        （2）事業者は、本サービスの利用に関連または付随して取得したユーザーに関する情報について、事業者が個人情報の保護に関する法律上の個人情報取扱事業者に該当するか否かを問わず、同法に定める個人情報取扱事業者としての義務等を遵守し、善良な管理者の注意をもってこれを管理しなければならないものとします。<br/>
        （3）事業者は、ユーザー情報を本契約の目的に必要最小限度の範囲の役職員に限りアクセスさせることができるものとし、かつ、ユーザー情報にアクセスする役職員に対して本条と同等の義務を課すものとし、当該役職員による違反について責任を負うものとします。<br/>
        （4）事業者は、当社から要求があった場合には、ユーザー情報の管理状況について当社に書面で報告しなければならないものとします。<br/>
        （5）事業者は、ユーザー情報の紛失、破壊、改竄、漏洩等が発生した場合には、直ちに当社に報告するとともに、当社と協議のうえ、事業者の費用負担において、事故の拡大または再発を防止するための適切な措置を講じるものとします。<br/>
        （6）事業者によるユーザー情報の管理・利用等によりユーザー情報が漏洩し、これに関連して当社がユーザーその他の第三者に損害賠償等の金銭の出捐を余儀なくされた場合には、事業者は、故意または過失の有無にかかわらず、当社が支払った金銭の全額および解決のために要した弁護士費用その他一切の費用を当社に対して支払うものとします。<br/>
        （7）当社は、tamate baco上で表示される事業者に関する情報、または、管理画面上で事業者が管理する情報が、次の各号のいずれかに該当する場合、事業者にその旨通知するとともに、当該情報を削除、変更または非表示化することができるものとします。<br/>
        　（a）本規約に違反する場合<br/>
        　（b）本サービスの運用・保守管理上、当社が必要であると判断した場合<br/>
        　（c）その他、当社が不適切と判断する場合<br/>
        （8）前項の定めにかかわらず、当社は、本サービスで利用されている情報が前項の各号に定める事項に該当すると判断した場合で、緊急やむを得ない場合は、その情報を事業者へ通知することなく直ちに削除することができるものとします。
        </p>

        <h2>
        第9条（設備等の準備・維持およびID・パスワードの管理）
        </h2>
        <p>
        （1）事業者は、本サービスを利用するために必要となるハードウェア、ソフトウェア、ネットワークその他周辺機器等の設備および通信環境の調達ならびにこれらの設定を、自己の費用と責任において行うものとします。事業者が使用した設備および通信環境の不具合によって事業者が本サービスを受けられなかったとしても、当社は何ら責任を負わないものとします。<br/>
        （2）事業者は、本サービスを利用するために当社から発行されたID・パスワードを、善良な管理者の注意をもって保管・管理するものとし、当該ID・パスワードによる行為は事業者による行為とみなすものとします。
        </p>

        <h2>
        第10条（無保証）
        </h2>
        <p>
        （1）当社は、事業者に対して、本サービスの利用による事業者または事業者サービスの知名度の向上、売上の増大その他の効果の発生を保証するものではありません。当社は、これらの効果が発生しなかったことを理由とする事業者からの一切の請求に応じる義務はないものとします。<br/>
        （2）事業者は、当社が、tamate bacoに掲載されている複数のパートナーサービス等の中から、プランの種類、催行場所等を考慮の上、当社の自由裁量で選択すること、事業者のサービスの全部または一部が本サービスの対象となることを保証するものではないことを了承し、かかる当社の選択について異議を述べないものとします。
        </p>

        <h2>
        第11条（知的財産権）
        </h2>
        <p>
        （1）事業者提供情報（本規約8条に定めるものをいいます。）の著作権その他一切の知的財産権は事業者または事業者に権利の利用を許諾した第三者に帰属するものとし、それ以外の本サービスまたは提携販売店サイトを構成するプログラム・文章・画像・動画その他一切の情報（当社が事業者提供情報を編集・改変して制作したテキスト、画像その他の情報を含みます。）の著作権その他一切の知的財産権は当社に帰属するものとします。<br/>
        （2）事業者は、当社に対し、事業者提供情報を当社または提携販売店が以下各号に定める範囲で使用することを無償で許諾するものとします。なお、事業者は、本項各号に定める範囲の事業者提供情報の利用について著作者人格権を行使しないものとします。また、事業者は、事業者提供情報について第三者から権利の利用許諾を受けている場合、当該第三者をして、当社に対して同様の権利許諾をさせ、著作者人格権を行使させないものとします。<br/>
        　（a）tamate bacoまたは提携販売店サイトの制作に必要な範囲での複製、改変その他の利用<br/>
        　（b）tamate bacoまたは提携販売店サイト（tamate bacoもしくは提携販売店サイトに関連または付随するものとして当社が管理・運営するWebサイトを含みます。）内のtamate bacoまたは提携販売店サイト以外のページへの掲載<br/>
        （3）本サービスまたは事業者プランの知名度の向上または販売の促進その他当社が本サービスの運営上合理的に必要と判断する目的での第三者が管理・運営・発行・放映・配信等する媒体（ウェブサイト、雑誌、テレビ放送、動画配信等を含みますがこれらに限りません。）への掲載
        </p>

        <h2>
        第12条（義務）
        </h2>
        <p>
         （1）事業者は、以下の各号に定める事由のいずれかが生じたときは、直ちに当社に対して報告しなければならないものとします。<br/>
        　（a）本サービスに掲載された事業者プランに関する事業を第三者に譲渡、または廃止・休業したとき<br/>
        　（b）合併、会社分割、株式交換、株式移転が行われたとき<br/>
        　（c）tamate bacoで購入したユーザーによる事業者サービスの利用が不可能または困難となる事由が生じたとき<br/>
        　（d）事業者サービスの提供において事故等が発生したとき<br/>
        　（e）本サービスの利用に関連または付随してユーザーその他の第三者との間でトラブルが発生したとき<br/>
        　（f）振込先となる金融機関口座の変更を希望するとき<br/>
        　（g）tamate bacoの内容について訂正または変更等を行う必要が生じたとき<br/>
        （2）事業者は、本条第1項第d号に定める事由が生じた場合、事故発生当日中に当社に対して報告するよう努力するものとし、事故発生の翌日までに当社に対して報告しなければならないものとします。
        </p>

        <h2>
        第13条（事業者サービスの委託）
        </h2>
        <p>
        （1）事業者は、事業者の責任において、事業者サービスの全部または一部を第三者（以下「委託先」といいます。）に委託することができるものとします。事業者は、委託先の名称および住所等を当社に報告するものとし、当社は、当該第三者に委託することが不適切であると合理的に判断する場合、その理由を事業者に書面にて通知することにより、当該第三者に対する委託の中止を請求することができるものとします。<br/>
        （2）事業者は、当該委託先との間で、委託に係る業務を遂行させることについて、本規約に基づいて事業者が負担するものと同様の義務を委託先に負わせる契約を締結するものとします。また、事業者は、委託先の行為についてすべての責任を負うものとします。
        </p>

        <h2>
        第14条（禁止事項）
        </h2>
        <p>
        事業者は、本サービスの利用にあたり、本規約に別途定めるもののほか、以下の各号に定める行為を行ってはならないものとします。<br/>
        （1）法令の定めに違反する行為またはそのおそれのある行為<br/>
        （2）公序良俗に反する行為<br/>
        （3）ユーザーの判断に錯誤を与えるおそれのある行為<br/>
        （4）当社または第三者に対し、財産権（知的財産権を含みます。）の侵害、名誉・プライバシーの侵害、誹謗中傷、その他の不利益を与える行為またはそのおそれのある行為<br/>
        （5）本サービスを利用するために当社から発行されたID・パスワードを第三者に貸与または譲渡する行為<br/>
        （6）本サービスで提供するシステムに対する有害なデータの送信、プログラム等の改竄等、本サービスの運営・維持を妨げる行為<br/>
        （7）サーバその他当社のコンピュータに不正にアクセスする行為<br/>
        （8）前各号の他、当社が別途禁止行為として定める行為<br/>
        （9）事業者プラン記載の利用条件の変更（ユーザー一般の通常のtamate bacoの利用を妨げない軽微な変更は除きます。）<br/>
        （10）事業者サービスに関し、本サービス上におけるtamate bacoの販売代金以外の金銭をユーザーに対して請求する行為（ただし、入湯税、ゴルフ場利用税、入山料その他当社が事前に書面で同意する金銭等については除きます。）
        </p>

        <h2>
        第15条（報酬の支払の留保・拒絶）
        </h2>
        <p>
        事業者が、以下の各号に定めるいずれかの事由に該当し、または該当するおそれがあると当社が判断する場合、当社は事業者に対する事業者分配金の支払いの全部または一部を留保しまたは拒絶することができるものとします。この場合、利息および遅延損害金は発生しないものとします。<br/>
        （1）事業者プラン記載の利用条件の不利益変更（ユーザー一般の通常のtamate bacoの利用を妨げない軽微な変更は除きます。）を行ったとき<br/>
        （2）事業者プラン記載の事業者サービスと実際に提供する事業者サービスの内容が異なるとき<br/>
        （3）他社や事業者が直接提供しているプランと内容が同等にも関わらず、当社への提供が高額でなされているとき<br/>
        （4）事業者の責に帰すべき事由によりユーザーが不当に不利益を被るとき<br/>
        （5）本契約の違反があり、当社が合理的な期間を定めてその是正を催告したにもかかわらず、当該期間内に違反が是正されないとき<br/>
        （6）事業者は、前項各号に該当する事由がありまたは該当するおそれがある事由がある場合、速やかに当社に対して通知するものとします。
        </p>

        <h2>
        第16条（事業者ページの修正・削除等）
        </h2>
        <p>
        当社は、事業者が以下の各号に定めるいずれかの事由に該当する場合には、体験詳細ページの全部または一部の修正、閲覧の一時停止、削除、その他の必要な措置を採ることができるものとします。この場合、事業者は速やかに当社の指示に従い、改善措置をとらなくてはならないものとします。<br/>
        （1）第14条または第15条の規定のいずれかに違反したとき<br/>
        （2）ユーザーから事業者の対応や事業者サービスの提供に関連して苦情が頻発したとき<br/>
        （3）事業者サービスに関連して事故が発生するなど事業者サービスの安全性等につき疑義が生じ、事業者による本サービスの利用が相当でないとき<br/>
        （4）本契約の違反があるとき<br/>
        （5）手形または小切手の不渡りが発生したとき<br/>
        （6）差押え、仮差押え、仮処分その他の強制執行または滞納処分の申立を受けたとき<br/>
        （7）破産手続開始、民事再生手続開始、会社更生手続開始もしくは特別清算手続開始の申立を受け、または自ら申立をしたとき<br/>
        （8）前3号の他、事業者の信用状態に重大な変化が生じたとき<br/>
        （9）解散または営業停止状態となったとき<br/>
        （10）その他当社が本条に基づく措置が必要であると合理的に判断したとき<br/>
        </p>

        <h2>
        第17条（サービスの一時停止）
        </h2>
        <p>
        （1）当社は、次の各号に定めるいずれかの事由がある場合には、事業者に対する事前<br/>
        の通知なく、本サービスの提供を一定期間停止することができるものとします。<br/>
        　（a）本サービスにおいて提供するシステムの一部または全部について、点検、修理、補修、仕様・機能の変更、改良・改修、障害対応等を実施する場合<br/>
        　（b）天災地変その他非常事態が発生し、もしくは発生するおそれがあり、本サービスの提供が困難または不可能になった場合<br/>
        　（c）法令等の改正・成立により、本サービスの提供が困難または不可能になった場合<br/>
        　（d）当社に対する債務（当社が事業者に提供する他のサービスに係る利用料、繰越金の残高その他を含みますが、これらに限りません。）について、履行遅滞がある場合<br/>
        　（e）当社から事業者に対する問い合わせに関して、問い合わせの翌日から3営業日以内に返答がないとき<br/>
        　（f）事業者が第19条（反社会的勢力の排除）に違反し、または違反するおそれがあると当社が判断した場合<br/>
        　（g）本規約の規定に違反し、違反状態を是正するように催告したにもかかわらず、違反状態を解消できなかった場合<br/>
        　（h）当社、ユーザー、他の事業者その他の第三者の利益を保護するため、その他当社がやむを得ないと判断した場合<br/>
        （2）事業者は、前項による本サービスの一時停止があることにつきあらかじめ承諾し、これを理由とする損害の賠償等を当社に対して請求しないものとします。<br/>
        </p>

        <h2>
        第18条（秘密保持）
        </h2>
        <p>
        （1）当社および事業者は、相手方より提供された資料、または本契約に関連して取得した相手方に関する営業上および技術上の情報（以下「秘密情報」といいます。）につき、厳に秘密を保持するものとし、これを第三者（当社および事業者の弁護士その他の法令上守秘義務を負う者は除きます。）に開示、漏洩してはならず、また本契約の目的以外に使用してはならないものとします。ただし、秘密情報が以下の各号のいずれかに該当する場合は、この限りではありません。<br/>
        　（a）知得した時点で、既に所有していた情報<br/>
        　（b）知得した時点で、既に公知の情報<br/>
        　（c）知得した後に、自らの責によらずに公知または公用となった情報<br/>
        　（d）正当な権利を有する第三者から、秘密保持の義務を負わず適法に入手した情報<br/>
        （2）前項の定めにかかわらず、当社および事業者は法令上、行政上および裁判上の手続に関連して開示を要求された場合ならびに監督官庁から開示を要求された場合には、秘密情報を開示することができるものとします。<br/>
        （3）第1項の定めにかかわらず、当社は、本サービスの運営に必要な範囲で、秘密保持契約を締結した提携会社等に対し、事業者に関する情報を提供することができるものとします。
        </p>

        <h2>
        第19条（反社会的勢力の排除）
        </h2>
        <p>
        （1）当社および事業者は、現在、暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、準暴力団、準暴力団に属する者、総会屋等、社会運動等標ぼうゴロまたは特殊知能暴力集団等その他これらに準ずる者（以下これらを「反社会的勢力」といいます。）に該当しないこと、および次の各号のいずれか一にも該当しないことを表明し、かつ将来にわたっても該当しないことを表明し、保証します。<br/>
        　（a）反社会的勢力が経営を支配していると認められる関係を有すること<br/>
        　（b）反社会的勢力が経営に実質的に関与していると認められる関係を有すること<br/>
        　（c）自己、自社もしくは第三者の不正の利益を図る目的または第三者に損害を加える目的をもってするなど、不当に反社会的勢力を利用したと認められる関係を有すること<br/>
        　（d）反社会的勢力に対して資金等を提供し、または便宜を供与するなどの関与をしていると<br/>
        認められる関係を有すること<br/>
        　（e）役員または経営に実質的に関与している者が反社会的勢力と社会的に非難されるべき関係を有すること<br/>
        （2）当社および事業者は、自らまたは第三者を利用して次の各号のいずれか一にでも該当する行為を行ってはならないものとします。<br/>
        　（a）暴力的な要求行為<br/>
        　（b）法的な責任を超えた不当な要求行為<br/>
        　（c）取引に関して、脅迫的な言動をし、または暴力を用いる行為<br/>
        　（d）風説を流布し、偽計を用いまたは威力を用いて相手方の信用を毀損し、または相手方の業務を妨害する行為<br/>
        　（e）その他前各号に準ずる行為<br/>
        （3）当社および事業者は、相手方が本条第1項のいずれか一にでも違反すると疑われる合理的な事情がある場合には、当該違反の有無につき、相手方の調査を行うことができ、相手方はこれに協力するものとします。また、当社または事業者は、自らが、第1項のいずれか一にでも違反し、またはそのおそれがあることが判明した場合には、相手方に対し、直ちにその旨を通知するものとします。<br/>
        （4）当社および事業者は、相手方が本条第1項から第3項のいずれか一にでも違反した場合は、相手方の有する期限の利益を喪失させ、また、通知または催告等何らの手続を要しないで直ちに本契約を解除することができるものとします。なお、本条第1項から第3項のいずれかの違反に起因して当社または事業者が損害を被った場合、相手方は当該当事者に対してかかる損害を賠償するものとし、本項に基づく解除権の行使によってもこれは妨げられないものとします。<br/>
        （5）当社および事業者は、前項に基づく解除により解除された当事者が被った損害につき、一切の義務または責任を負わないものとします。
        </p>

        <h2>
        第20条（解除）
        </h2>
        <p>
        当社は、事業者が以下の各号に定めるいずれかの事由に該当した場合には、何らの催告を要せずに本契約を解除するとともに、本サイト内の事業者に関する情報をすべて削除することができるものとします。<br/>
        （1）第16条第1項各号に該当する場合<br/>
        （2）前条の規定に違反した場合<br/>
        （3）その他当社が事業者との本契約の継続が困難であると判断した場合前項により本契約が終了した場合、当社は、当該解除に起因して事業者に生じた損害につき一切責任を負わないものとします。
        </p>

        <h2>
        第21条（期限の利益の喪失）
        </h2>
        <p>
        本契約の定めにかかわらず、事業者が第16条第5号から第9号までのいずれかに該当した場合または第19条の規定に違反した場合には、事業者は、何らの通知催告を要せず、当社に対する一切の債務につき当然に期限の利益を喪失するものとします。本契約の定めにかかわらず、事業者が以下の事由のいずれかに該当した場合には、当社からの請求によって、事業者は、当社に対する一切の債務につき期限の利益を喪失するものとします。<br/>
        （1）第16条第1号ないし第4号に該当する場合<br/>
        （2）第17条に基づく体験詳細ページの閲覧の一時停止がなされている場合で、かつ、速やかに当社の指示に従った改善措置を行わず、または行う見込みがない場合<br/>
        （3）前各号のほか債権保全を必要とする相当の事由が生じた場合
        </p>

        <h2>
        第22条（事業者による解約）
        </h2>
        <p>
        事業者は、6か月前までに当社が別途指定する方法によって当社に通知することにより、いつでも本契約を解約することができます。ただし、事業者は、本契約終了日までにtamate bacoを利用した予約を完了したユーザーに対し、引き続き本契約の適用条項に従い、当該事業者サービスを提供なければならないものとします。
        </p>

        <h2>
        第23条（免責）
        </h2>
        <p>
        当社が、第8条第7項（情報の取扱い）、第16条（事業者ページの修正・削除等）または第17条（サービスの一時停止）の定めに基づく措置を行ったことにより、事業者、ユーザーまたは第三者に損害が発生したとしても、当社は一切その責任を負いません。
        </p>

        <h2>
        第24条（サービス終了後の措置）
        </h2>
        <p>
        （1）本契約の終了後、当社は、事業者による本サービスの利用を停止します。<br/>
        （2）事業者は、本契約終了日までにtamate bacoを利用した予約を完了したユーザーに対し、引き続き本契約の適用条項に従い、当該事業者サービスを提供しなければならないものとします。<br/>
        （3）当社は、本契約の終了日以降に、事業者提供情報を含む事業者に関連するすべての情報を削除することができるものとします。ただし、当社はその義務を負うものではありません。<br/>
        （4）本契約の終了時点で事業者に未履行の債務がある場合には、当該債務の履行に必要な範囲で本契約は、なお効力を有するものとします。
        </p>

        <h2>
        第25条（不可抗力）
        </h2>
        <p>
        停電・通信回線の事故・天災等の不可抗力、通信事業者の不履行、インターネット通信回線の不具合、サーバ等のシステム上の不具合または緊急メンテナンスの発生その他当社の責に帰すことのできない事由により、サーバまたはソフトウェアの障害・不具合・誤動作、事業者ページの全部または一部の滅失、本サービスの全部または一部の停止等の事態が発生した場合であっても、これに起因して事業者に生じた損害等につき、当社は一切の責任を負わないものとします。
        </p>

        <h2>
        第26条（契約上の地位の譲渡禁止）
        </h2>
        <p>
        当社および事業者は、本契約に基づく自らの契約上の地位、権利または義務を、第三者に対して譲渡、移転、担保権設定その他の方法による処分をしてはならず、または、第三者に引き受けさせてはならないものとします。ただし、相手方の書面による事前の同意がある場合にはこの限りではありません。
        </p>

        <h2>
        第27条（存続条項）
        </h2>
        <p>
        第18条（秘密保持）の規定は、利用契約の終了または有効期間満了後も、3年間有効なものとして存続するものとします。<br/>
        第6条（事業者サービスの提供）第3項および第4項、第8条（情報の取扱い）第1項から第6項、第11条（知的財産権）、第14条（禁止事項）第3号から第8号、第23条（免責）、第26条（契約上の地位の譲渡禁止）、本条、第28条（分離性）、第29条（準拠法）、第30条（合意管轄）、および第31条（協議）の規定は、本契約の終了後も有効なものとして存続するものとします。
        </p>

        <h2>
        第28条（分離性）
        </h2>
        <p>
        本規約の条項が、法令に抵触すると判断された場合またはいずれの当事者との関係においても法的拘束力を有しないと判断された場合、当該条項は、当該法令に抵触しまたは法的拘束力を有しないと判断された限度で無効とみなされるものとし、本規約の他の全ての条項は有効に存続するものとします。
        </p>

        <h2>
        第29条（準拠法）
        </h2>
        <p>
            本契約は日本法を準拠法とし、かつ、同法に従い解釈されます。
        </p>

        <h2>
        第30条（合意管轄）
        </h2>
        <p>
            本契約に関連して生じた紛争については、訴額に応じて、東京簡易裁判所または東京地方裁判所を第一審の専属的合意管轄裁判所とします。
        </p>

        <h2>
        第31条（協議）
        </h2>
        <p>
            本契約に定めのない事項および本契約の解釈につき疑義を生じた事項については、当社および事業者間で誠実に協議のうえ、友好的に解決するものとします。
        </p>

        <h2>
        第32条（附属細則の制定および規約類の変更）
        </h2>
        <p>
        （1）当社は、必要と認めたときに、事業者の事前の承諾を要することなく、本規約に付随する細則（以下「附属細則」といい、本規約と併せて「本規約類」といいます。）を制定することができ、また、本規約類の内容を変更することができるものとします。<br/>
        （2）当社は、附属細則を制定し、または本規約類を変更した場合には、制定した附属細則または変更した本規約類を管理画面または所定のWebサイト上に掲載することにより事業者に対して通知するものとします。かかる通知の到達後1週間以内に事業者から異議が述べられなかった場合には、事業者は附属細則の制定および規約類の変更に同意したものとみなし、以後、制定された附属細則および変更後の規約類を適用するものとします。<br/>
        <br/>
        <br/>
        以上　<br/>
        <br/>
        策定　平成30年4月27日<br/>
        <br/>
        </p>

    </div>
</div>

@endsection
