import React, { Component } from 'react';
import { withRouter } from 'react-router-dom'
import { connect } from 'react-redux'
import { bindActionCreators } from 'redux'

import Meta from "../../components/layout/Meta";
import { HeaderText, Header2Text } from "../../components/util/Text";

class TermScreen extends Component {
  render = () => {
    return (
      <div>
        <Meta title="利用規約" />
        <div className="uk-section uk-section-large">
          <div className="uk-container uk-container-small">
            <HeaderText>
              利用規約
            </HeaderText>

            <p>
            この利用規約（以下、「本規約」といいます。）は、株式会社TODOROKI（以下、「当社」といいます。）が運営するWebサイト「tamate baco」上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。
            </p>

            <Header2Text>
            第1条（適用）
            </Header2Text>
            <p>
            本規約は、ユーザーと当社との間の本サービスの利用に関わる一切の関係に適用されるものとします。
            </p>

            <Header2Text>
            第2条（用語の定義について）
            </Header2Text>
            <p>
            本規約において使用する用語の意義は、次の各号に定めるとおりとします。<br/>
            （1）「体験」とは、事業者が提供する体験型プログラムその他の予約申込が必要な役務をいいます。<br/>
            （2）「事業者」とは、当社と契約のうえ、「tamate baco」に体験、又はイベントの情報を掲載する法人又は個人をいいます。<br/>
            （3）「チケット」とは、一定の条件に従い当社から発行される電磁的記録を提示することで、事業者から事業者の管理する施設への入場許可その他の商品又は役務（以下「事業者サービス」といいます。）の提供を受けることができる権利をいいます。<br/>
            （4）「登録情報」とは、メールアドレス、ID、パスワード、氏名、生年月日、性別などユーザーが当社に提供する情報をいいます。
            </p>

            <Header2Text>
            第3条（利用登録）
            </Header2Text>
            <p>
            登録希望者が当社の定める方法によって利用登録を申請し、当社がこれを承認することによって、利用登録が完了するものとします。<br/>
            当社は、利用登録の申請者に以下の事由があると判断した場合、利用登録の申請を承認しないことがあり、その理由については一切の開示義務を負わないものとします。<br/>
            （1）利用登録の申請に際して虚偽の事項を届け出た場合<br/>
            （2）本規約に違反したことがある者からの申請である場合<br/>
            （3）その他、当社が利用登録を相当でないと判断した場合
            </p>

            <Header2Text>
            第4条（登録メールアドレスおよびパスワードの管理）
            </Header2Text>
            <p>
            （1）ユーザーは、自己の責任において、本サービスの登録メールアドレスおよびパスワードを管理するものとします。<br/>
            （2）ユーザーは、いかなる場合にも、登録メールアドレスおよびパスワードを第三者に譲渡または貸与することはできません。当社は、登録メールアドレスとパスワードの組み合わせが登録情報と一致してログインされた場合には、その登録メールアドレスを登録しているユーザー自身による利用とみなします。
            </p>

            <Header2Text>
            第5条（退会について）
            </Header2Text>
            <p>
            ユーザーは、退会を希望する場合、当社指定の退会手続を行うものとします。当社は、退会した方の登録情報について継続して保有する義務を負わないものとします。
            </p>

            <Header2Text>
            第6条（個人情報の取り扱い）
            </Header2Text>
            <p>
            弊社は、個人情報を「プライバシーポリシー」に基づき、適切に取り扱うものとします。
            </p>

            <Header2Text>
            第7条（統計データ等の閲覧、利用）
            </Header2Text>
            <p>
            当社は、登録情報及びユーザーの本サービスの利用履歴等を、特定の個人を識別できないように加工、集計及び分析した統計データ等を作成し、当該利用履歴又は統計データ等を何らの制限なく閲覧、利用（第三者に閲覧、利用させること、マーケティング資料としての提供、本サービスの新機能の開発、市場の調査を含みますが、これに限られません）することができるものとし、ユーザーはこれをあらかじめ承諾します。
            </p>

            <Header2Text>
            第8条（利用料金および支払方法）
            </Header2Text>
            <p>
            （1）ユーザーは、本サービス利用の対価として、当社が別途定め、本ウェブサイトに表示する利用料金を、当社が指定する方法により支払うものとします。<br/>
            （2）ユーザーが利用料金の支払を遅滞した場合には、ユーザーは年14.6％の割合による遅延損害金を支払うものとします。
            </p>

            <Header2Text>
            第9条（禁止事項）
            </Header2Text>
            <p>
            ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。<br/>
            <br/>
            （1）法令または公序良俗に違反する行為<br/>
            （2）犯罪行為に関連する行為<br/>
            （3）当社のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為<br/>
            （4）当社のサービスの運営を妨害するおそれのある行為<br/>
            （5）他のユーザーに関する個人情報等を収集または蓄積する行為<br/>
            （6）他のユーザーに成りすます行為<br/>
            （7）当社のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為<br/>
            （8）その他、当社が不適切と判断する行為
            </p>

            <Header2Text>
            第10条（本サービスの提供の停止等）
            </Header2Text>
            <p>
            当社は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。<br/>
            （1）本サービスにかかるコンピュータシステムの保守点検または更新を行う場合<br/>
            （2）地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合<br/>
            （3）コンピュータまたは通信回線等が事故により停止した場合<br/>
            （4）その他、当社が本サービスの提供が困難と判断した場合<br/>
            当社は、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害について、理由を問わず一切の責任を負わないものとします。
            </p>

            <Header2Text>
            第11条（利用制限および登録抹消）
            </Header2Text>
            <p>
            当社は、以下の場合には、事前の通知なく、ユーザーに対して、本サービスの全部もしくは一部の利用を制限し、またはユーザーとしての登録を抹消することができるものとします。<br/>
            （1）本規約のいずれかの条項に違反した場合<br/>
            （2）登録事項に虚偽の事実があることが判明した場合<br/>
            （3）その他、当社が本サービスの利用を適当でないと判断した場合<br/>
            当社は、本条に基づき当社が行った行為によりユーザーに生じた損害について、一切の責任を負いません。
            </p>

            <Header2Text>
            第12条（免責事項）
            </Header2Text>
            <p>
            （1）体験の予約もしくは利用に関する契約又はチケット購入契約の当事者は、会員と事業者であり、当社は当該契約の当事者とはなりません。当社は、事業者による当該契約の履行に関して一切の責任を負わないものとします。<br/>
            （2）当社は、ユーザーと事業者との間、又はユーザー間に生じた一切のトラブルについて、一切の責任を負わないものとします。万一、ユーザーと事業者との間、又はユーザー間に紛争等が発生し、当社が直接これにやむを得ず対応した場合、ユーザーは、当社に発生した損害の一切を補償するものとします。<br/>
            （3）ユーザーは、①ユーザーが本サービスを利用したこと、又は利用できなかったこと、②不正アクセスや不正な改変がなされたこと、③本サービスにおける他のユーザーによる行為、④第三者によるなりすまし行為、⑤その他本サービスに関連する事項に起因又は関連して生じた一切の損害に関して、当社が損害賠償責任を負わないことに同意します。<br/>
            （4）当社は、当社、事業者又はユーザーが提供する情報、助言の真実性、最新性、確実性、有用性等について保証しません。当社は、当社、事業者又はユーザーが提供する情報、助言に関連してユーザーに発生した損害について、一切の責任を負わないものとします。<br/>
            （5）当社は、本サービスに瑕疵がないことを保証しません。当社は、万一本サービスに瑕疵があることが判明した場合、その修正に努めますが本サービスの瑕疵に起因してユーザーに発生した損害について、一切の責任を負わないものとします。<br/>
            （6）当社が損害賠償責任を負う場合についても、当社に故意又は重大な過失がある場合を除いて、当社は、当該ユーザーが直接かつ現実に被った損害、かつ損害に関連する体験料金等相当額又はチケット料金相当額を上限として損害賠償責任を負うものとし、特別な事情から生じた損害（損害発生につき予見し、又は予見し得た場合を含む）については責任を負わないものとします。<br/>
            （7）価格や内容について、同一の事業者が他のサイトで提供している情報と異なる場合があり、当社は「tamate baco」に掲載されている取引条件がユーザーにとって最も有利な条件であることを保証しません。
            </p>

            <Header2Text>
            第13条（サービス内容の変更等）
            </Header2Text>
            <p>
            当社は、ユーザーに通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによってユーザーに生じた損害について一切の責任を負いません。
            </p>
            
            <Header2Text>
            第14条（利用規約の変更）
            </Header2Text>
            <p>
            当社は、必要と判断した場合には、ユーザーに通知することなくいつでも本規約を変更することができるものとします。
            </p>

            <Header2Text>
            第15条（通知または連絡）
            </Header2Text>
            <p>
            （1）ユーザーと当社との間の通知または連絡は、当社の定める方法によって行うものとします。<br />
            （2）当社は、本サービス上での掲示や電子メールの送付、その他当社が適当と判断する方法により、ユーザーに対して随時必要な事項を通知します。また、ユーザーは本サービスに登録した時点より、当社から電子メール等による通知を受けることを承諾したものとします。本サービスの機能の一環、運営上の告知などの理由ユーザーがFacebook、または本サービスに登録したメールアドレスへ電子メールを送信することがございます、なお、当該通知は本サービス上に掲示した時点、または電子メール等を送信した時点より効力を発するものとします。
            </p>

            <Header2Text>
            第16条（権利義務の譲渡の禁止）
            </Header2Text>
            <p>
            ユーザーは、当社の書面による事前の承諾なく、利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し、または担保に供することはできません。
            </p>

            <Header2Text>
            第17条（準拠法・裁判管轄）
            </Header2Text>
            <p>
            （1）本規約の解釈にあたっては、日本法を準拠法とします。<br/>
            （2）本サービスに関して紛争が生じた場合には、当社の本店所在地を管轄する裁判所を専属的合意管轄とします。
            </p>

            <Header2Text>
            第18条　（基準時）
            </Header2Text>
            <p>
            ユーザーによる予約申込、予約申込のキャンセル、有効期限その他本サービスに関連して基準となる時刻は、全て日本時間によるものとします。
            </p>

            <Header2Text>
            第19条　（予約の変更・キャンセル）
            </Header2Text>
            <p>
            （1）ユーザーは、利用契約の変更、キャンセルの可否、キャンセル料その他の条件については、事業者の定めるキャンセルポリシー、規約等に従うことを承諾します。<br/>
            （2）ユーザーは、事業者の定めるキャンセルポリシー、規約等に従い、本サービスを通じて当社の定める方法で利用契約の変更、キャンセルの申込をすることができます。この場合、ユーザーは、ユーザーの登録メールアドレスに当該申込を承諾する旨の通知がされた時点で、利用契約の変更、キャンセルの効力が発生することを承諾します。<br/>
            （3）前項に定める他、ユーザーは、事業者の定めるキャンセルポリシー、規約等に従い、事業者との間で合意のうえ、チケットの変更及びキャンセルをすることができます。<br/>
            （4）ユーザーは、体験の利用契約が成立した場合でも、悪天候その他の理由により体験の利用ができなくなる場合があることを予め了承するものとします。<br/>
            （5）体験の利用契約の変更、キャンセル等に起因して、ユーザーと事業者との間でトラブル、紛争等が生じた場合、ユーザーと事業者との間で直接解決するものとし、当社は一切の責任を負わないものとします。<br/>
            （6）tamate baco開封後、事業者の都合により予定していた体験が不可能となった場合、同等の体験と変更します。同等の体験がない場合は、キャンセル扱いとし返金します。<br/>
            <br/>
            <br/>
            以上　<br/>
            <br/>
            策定　平成30年4月27日
            </p>
          </div>
        </div>
      </div>
    );
  }
}

const mapStateToProps = state => {
    return {
    };
};

const mapDispatchToProps = dispatch => ({
    actions: bindActionCreators({
    }, dispatch)
});

export default withRouter(connect(mapStateToProps, mapDispatchToProps)(TermScreen))